In [49]:
import pandas as pd
import numpy as np

seaDic = {
    "연도" : [1996, 1997, 1998, 1999],
    "동해" : [15, 13, 17, 18],
    "남해" : [16, 14, 16, 18],
    "서해" : [17, 15, 15, 17],
    "전체" : [18, 16, 14, 17]
}

columnsList = ["연도", "동해", "남해", "서해", "전체"]

In [50]:
dataFrame = pd.DataFrame(seaDic, columns = columnsList).set_index('연도')
dataFrame

      동해  남해  서해  전체
연도
1996  15  16  17  18
1997  13  14  15  16
1998  17  16  15  14
1999  18  18  17  17

In [51]:
# Create csv file
dataFrame.to_csv('sea_rain.csv', encoding="UTF8")

In [52]:
# Load csv file
loadDataFrame = pd.read_csv('sea_rain.csv', index_col='연도', encoding="UTF8")
loadDataFrame

      동해  남해  서해  전체
연도
1996  15  16  17  18
1997  13  14  15  16
1998  17  16  15  14
1999  18  18  17  17